#!/usr/bin/env bash

# 定义一个文件的绝对路径
path="/home/user/docs/file.txt"

# ______________________________________________________________
# 🔴dirname：返回目录路径（去掉最后的文件名部分）, 用于获取文件的父目录
# ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
dirname "$path"                     # /home/user/docs
# 注意: 如果末尾带 / 的话, 会影响结果
dirname '/home/user/docs/'          # /home/user
echo -e "\e[1;31m/_/_/_/_/_/_/_/_/_/_/_/_/_/_分割线_/_/_/_/_/_/_/_/_/_/_/_/_/_/\e[0m"

# ______________________________________________________________
# 🔴basename：返回文件名部分（去掉前面的目录）
# ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
# 获取带着后缀的文件名称
basename "$path"  # file.txt
# 获取不带任何后缀的文件名称
basename "$path" '.txt'  # file