#!/usr/bin/env bash

# ------------------------------------------------------------------------
# 1. -print0 和 xargs -0
#    将文件名以空字符（null 字符，\0）分隔，使 xargs 可以正确解析文件名中的任何字符
#    包括空格、换行符、单引号、双引号等。
# 2. 这种写法是获取文件名的最佳实践
# 3. readlink -f
#    用来显示文件的绝对路径
# ------------------------------------------------------------------------
# find 配合 readlink 获取文件的绝对路径
find ./ -name "*.sh" -print0 | xargs -0 readlink -f | head
echo -e "\e[1;31m/_/_/_/_/_/_/_/_/_/_/_/_/_/_分割线_/_/_/_/_/_/_/_/_/_/_/_/_/_/\e[0m"

# find 配合 realpath 获取文件的绝对路径
find ./ -name "*.sh" -print0 | xargs -0 realpath | head
