#!/usr/bin/env bash

# ------------------------------------------------------------------------
# mapfile 命令是 Bash 内置的命令，与 readarray 的用法基本相同
# 适用于 Bash 4 及以上版本
#
# ⏹选项
# -t 
#   删除每行末尾的换行符。这是常用选项，因为默认情况下，mapfile 会保留行末的换行符。
# -d
#   指定自定义的分隔符（默认为换行符）。
# -n 
#   指定要读取的最大行数。
# -s
#   跳过指定行数后开始读取。
# ------------------------------------------------------------------------

cd "99-技巧\01-文件\01-读取文件到数组" || exit 1

# 只读取文件的前两行
mapfile -n 2 -t lines < msg.txt

# 输出数组中的内容
for line in "${lines[@]}"; do
    echo "$line"
done

echo -e "\e[1;31m/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_分割线_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_\e[0m"

mapfile -t files < <(find ./ -name "*.sh" -print0 | xargs -0 readlink -f)
for file in "${files[@]}"; do
    echo "$file"
done